var input = [
    "5"
];
function main() {
    var dict = {
        5: 'A',
        3: 'C',
        2: 'D',
        4: 'B',
        1: 'E'
    };
    console.log(dict[input[0]]);

}

main();
[
    "テスト 1",
    "ケース 1（基本データ）",
    "通過",
    "0.06 秒",
    "テスト 2",
    "ケース 1（基本データ）",
    "通過",
    "0.07 秒",
    "テスト 3",
    "ケース 1（基本データ）",
    "通過",
    "0.06 秒",
    "テスト 4",
    "ケース 1（基本データ）",
    "通過",
    "0.06 秒",
    "テスト 5",
    "ケース 1（基本データ）",
    "通過",
    "0.06 秒",
    "テスト 6",
    "ケース 1（基本データ）",
    "通過",
    "0.06 秒",
    "テスト 7",
    "ケース 1（基本データ）",
    "通過",
    "0.06 秒",
    "テスト 8",
    "ケース 1（基本データ）",
    "通過",
    "0.06 秒",
    "テスト 9",
    "ケース 1（基本データ）",
    "通過",
    "0.06 秒",
    "テスト 10",
    "ケース 1（基本データ）",
    "通過",
    "0.06 秒"
]

/**
 * Created by Administrator on 2016/11/5 0005.
 */